# -*- coding: utf-8 -*-

token = 'ваш токен'

# Я использую бесплатный прокси для проверки функциональности. Рекомендуется использовать коммерческий вариант,
# или найти бесплатный api для поиска действующего прокси
# proxy = 'https://103.35.64.12:3128'

# bot сохранит файл .torrent по этому пути. Далее файл заберет QbitTorrent автоматически
torrent_path = 'tmp_torrent/tmp.torrent'

# id чата, в который бот будет отправлять уведомления
chat_id = '11111111'
# url QBitTorrent UI. При настройках по умолчанию, оставляем текущее значение
qbit_url = 'http://localhost:8080'
# Разделы для отправки свободного места
mount_disk = ["/", "/data"]
# id пользователей telegram, которым разрешен доступ
enabled_users = [369332243]
